1. Да се направи веб страница која за четирицифрен број внесен од тастатура (преку prompt
прозорец) ќе провери дали е палиндром и дали се дели со збирот на неговите цифри. Доколку
внесениот број не е четирицифрен треба да се испечати порака во alert прозорец дека не може да се
провери внесениот број, во спротивно во една порака исто така во alert прозорец се пишува дали е
палиндром и дали е деллив.



2. Да се направи веб страница каде од тастатура (преку prompt) се чита мобилен број во следниот
формат XXYYYZZZ (пр. 71298486). Програмата треба во конзола да го испечати во формат
XXX/YYY-ZZZ (пр. 071/298-486). Дополнително, треба да го испечати и името на операторот.
(070/071/072 - T-mobile, 075/076 – One, 077/078 – Vip).
3. Да се направи веб страница каде од тастатура (преку prompt) ќе се внесат 3 стрингови. Програмата
треба во alert прозорец да го испечати најдолгиот збор во рамките на сите 3 стрингови.
Пример
Влез: Прва лабораториска вежба
 Во оваа лабораторија е многу жешко
 Надвор е убав ден
Излез: лабораториска


4. Да се направи веб страница во која ќе има 2 input полиња (со објаснување што треба да се внесе
во овие полиња) и едно копче Calculate, за внесување на тежина (во килограми) и висина (во
центиметри) на човек. При клик на копчето Calculate, треба да се пресмета BMI на човекот и да се
запише во alert прозорец. Формула: BMI = kg/m2
(тежината во килограми поделена со висината во
метри на квадрат.)



5. Да се направи веб страница каде со JavaScript ќе се изминат броевите од 0 до 30. Во секоја
итерација тековниот број ќе се печати на екран (document.write) и ќе пишува дали бројот е парен или
непарен.
Пример
0 е парен број.
1 е непарен број.
2 е парен број.
...
